Project1/app/controllers/session_controller.rb

  def create
    credentials = JSON.parse(request.body.read)
    user = User.where(username: credentials['username']).first
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["username", "admin"], ["LIMIT", 1]]