Project1/app/controllers/user_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "user5"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-30 21:18:53.126845"], ["updated_at", "2023-03-30 21:18:53.126845"]]
---
  def create
    user = User.new(username: params[:username], password: params[:password])
    if user.save

SELECT "users".* FROM "users"
---
  def show
    users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]
---
  def destroy
    user = User.find(params[:id])
    if user.present?
      user.delete