Project1/app/controllers/concerns/authenticatable.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def authenticate_request!
    token_data = JsonWebToken.decode(token)
    @current_user = User.find(JsonWebToken.decode(token)['user_id'])